In [3]:
import pandas as pd
from glob import glob

In [44]:
files = glob("data/names/*")
dfs = []
for f in files:
    df = pd.read_csv(f, header=None)
    df.columns = ["Name", "Gender", "Count"]
    df["Year"] = int(f.split("/")[-1][3:-4])
    dfs.append(df)
df = pd.concat(dfs, axis=0, ignore_index=True)
df.head()

      Name Gender  Count  Year
0    Emily      F  25953  2000
1   Hannah      F  23080  2000
2  Madison      F  19967  2000
3   Ashley      F  17997  2000
4    Sarah      F  17697  2000

In [45]:
df.shape

(1604865, 4)

In [47]:
agg = df.groupby(["Name", "Gender"])["Count"].sum().reset_index()
agg.head()

        Name Gender  Count
0      Aaban      M    107
1      Aabha      F     35
2      Aabid      M     10
3      Aabir      M      5
4  Aabriella      F     32

In [48]:
agg.to_csv("data/first_names.csv", index=False)